tidklaas/esp32-gameboy-printer/main/gb_printer.c
    ESP_LOGI(TAG, "Initializing SPIFFS");

    cfg.base_path = "/img";
    cfg.partition_label = NULL;
    cfg.max_files = MAX_CONNECTIONS;
    cfg.format_if_mount_failed = true;

    result = esp_vfs_spiffs_register(&cfg);

    switch(result){
    case ESP_OK:
        break;
    case ESP_FAIL:
        ESP_LOGE(TAG, "Failed to mount or format filesystem");
        break;
    case ESP_ERR_NOT_FOUND:
        ESP_LOGE(TAG, "Failed to find SPIFFS partition");
        break;
    default:
        ESP_LOGE(TAG, "Failed to initialize SPIFFS (%s)", esp_err_to_name(result));
        break;
    }

    return result;
}

static esp_err_t event_handler(void *ctx, system_event_t *event)
{
    switch(event->event_id) {
        case SYSTEM_EVENT_AP_STACONNECTED:
            ESP_LOGI(TAG, "station:"MACSTR" join, AID=%d",
                     MAC2STR(event->event_info.sta_connected.mac),
                     event->event_info.sta_connected.aid);
            break;
        case SYSTEM_EVENT_AP_STADISCONNECTED:
            ESP_LOGI(TAG, "station:"MACSTR"leave, AID=%d",
                     MAC2STR(event->event_info.sta_disconnected.mac),
                     event->event_info.sta_disconnected.aid);
            break;
        default:
            break;
    }
    return ESP_OK;
}

void wifi_init_softap()
{
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    wifi_config_t wifi_config = {
        .ap = {
            .ssid = WIFI_SSID,
            .ssid_len = strlen(WIFI_SSID),
            .max_connection = MAX_STA_CONN,
            .authmode = WIFI_AUTH_OPEN,
        },
    };

    wifi_event_group = xEventGroupCreate();

    tcpip_adapter_init();
    ESP_ERROR_CHECK(esp_event_loop_init(event_handler, NULL));
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
    ESP_ERROR_CHECK(esp_wifi_set_config(ESP_IF_WIFI_AP, &wifi_config));
    ESP_ERROR_CHECK(esp_wifi_start());

}

static void IRAM_ATTR sclk_isr_handler(void* arg)
{
    struct spi_ctrl *ctrl;
    struct pr_packet *packet;
    uint64_t curr_time;
    BaseType_t task_woken;

    ctrl = (struct spi_ctrl *) arg;
    packet = &(ctrl->work_packet);

    if(gpio_get_level(GPIO_SCLK) == 0){
        // Falling edge. Set up MISO.
        curr_time = esp_timer_get_time();
        // Check for sync loss while receiving/sending byte
        if(unlikely(ctrl->clk_cnt != 0 && (curr_time - ctrl->clk_last) > 200)){
            ctrl->clk_cnt = 0;
            ctrl->rcv_data = 0;
            ctrl->snd_data = 0;
        }

        /* */
        if(unlikely(   packet->state != state_sync0
                    && (curr_time - ctrl->clk_last) > 5100))
        {
            packet->state = state_sync0;
        }

        ctrl->clk_last = curr_time;

        gpio_set_level(GPIO_MISO, (ctrl->snd_data & 0x80u) ? 1 : 0);
        ctrl->snd_data <<= 1;
    } else {
        // Rising edge. Sample MOSI and increase clock count.
        if(unlikely(ctrl->clk_cnt == 0)){
            ctrl->rcv_data = 0;
        }

        ctrl->rcv_data <<= 1;
        if(gpio_get_level(GPIO_MOSI)){
            ctrl->rcv_data |= 1;
        }

        ++ctrl->clk_cnt;
    }

    if(likely(ctrl->clk_cnt <= 7)){
        goto done;
    }

    ctrl->clk_cnt = 0;

    if(unlikely(packet->state == state_done)){
        packet->state = state_sync0;
    }

    if(packet->state >= state_cmd && packet->state < state_chk_low){
        packet->cur_sum += ctrl->rcv_data;
    }

    switch(packet->state){
    case state_sync0:
        if(ctrl->rcv_data == 0x88){
            packet->cur_sum = 0;
            packet->data_len = 0;
            ctrl->status_isr = 0;
            packet->state = state_sync1;
        }
        break;
    case state_sync1:
        if(ctrl->rcv_data == 0x33){
            packet->state = state_cmd;
        } else {
            packet->state = state_sync0;
        }
        break;
    case state_cmd:
        packet->cmd = ctrl->rcv_data;
        packet->state = state_compr;
        break;
    case state_compr:
        packet->compr = ctrl->rcv_data;
        packet->state = state_len_low;
        break;
    case state_len_low:
        packet->cur_len = ctrl->rcv_data;
        packet->state = state_len_high;
        break;
    case state_len_high:
        packet->cur_len |= (ctrl->rcv_data << 8);

        if(likely(packet->cur_len <= sizeof(packet->data))){
            if(packet->cur_len > 0){
                packet->state = state_data;
            } else {
                packet->state = state_chk_low;
            }
        } else {
            /* Bogus data length. We could try inferring the real length
             * from the command byte, but since we probably have lost
             * synchronisation anyway, we just give up on this packet */
            packet->state = state_sync0;
        }
        break;
    case state_data:
        packet->data[packet->data_len++] = ctrl->rcv_data;
        --packet->cur_len;

        if(unlikely(packet->cur_len == 0)){
            packet->state = state_chk_low;
        }
        break;
    case state_chk_low:
        packet->chk_sum = ctrl->rcv_data;
        packet->state = state_chk_high;
        break;
    case state_chk_high:
        packet->chk_sum |= (ctrl->rcv_data << 8);

        /* We need to send the ACK byte next. */
        ctrl->snd_data = 0x81;

        packet->state = state_ack;
        break;
    case state_ack:
        if(unlikely(packet->chk_sum != packet->cur_sum)){
            ctrl->status_isr |= (STATUS_CHKSUM | STATUS_ERR0);
        } else {
            switch(packet->cmd){
            case cmd_data:
                /* We expect to always receive complete bands (20 tiles)
                 * of image data.  */
                if(packet->data_len % 40 == 0)
                {
                    ctrl->status_isr |= STATUS_UNPROC;
                } else {
                    ctrl->status_isr |= STATUS_ERR0;
                }
                break;
            case cmd_print:
                if(packet->data_len == PR_PARAM_SIZE){
                    ctrl->status_isr &= ~STATUS_UNPROC;
                    ctrl->status_isr |= STATUS_FULL;
                } else {
                    ctrl->status_isr |= STATUS_ERR0;
                }
                break;
            case cmd_inquiry:
            case cmd_init:
            case cmd_break:
                break;
            }
            if(ctrl->packets[ctrl->wr_idx].owner == own_isr){
                memcpy(&(ctrl->packets[ctrl->wr_idx]), packet, sizeof(*packet));
            } else {
                ctrl->status_isr |= STATUS_BUSY;
            }
        }
 
        ctrl->snd_data = (ctrl->status_isr | ctrl->status_task);
        packet->state = state_status;
        break;
    case state_status:
        ctrl->snd_data = 0;
        packet->state = state_done;
        break;
    default:
        packet->state = state_sync0;
        break;
    }

    if(   unlikely(packet->state == state_done)
       && likely((ctrl->status_isr & (STATUS_ERR0 | STATUS_BUSY)) == 0))
    {
        asm volatile ("" : : : "memory");
        ctrl->packets[ctrl->wr_idx].owner = own_task;
        asm volatile ("" : : : "memory");

        xSemaphoreGiveFromISR(ctrl->packet_done, &task_woken);
        if(task_woken){
            portYIELD_FROM_ISR();
        }

