tidklaas/esp32-gameboy-printer/main/gb_printer.c
        ++ctrl->wr_idx;
        ctrl->wr_idx %= ARRAY_SIZE(ctrl->packets);
        ctrl->status_isr = 0;
    }

done:
    return;
}

void IRAM_ATTR packet_proto_task(void *pvParameters)
{
    struct pr_packet *packet;
    struct pr_data *data = NULL;

    ESP_LOGI(TAG, "Packet proto task started");
    while(1) {
        packet = &(ctrl.packets[ctrl.rd_idx]);
        if(packet->owner == own_isr){
            xSemaphoreTake(ctrl.packet_done, 10 * portTICK_PERIOD_MS);
        }
        
        if(data == NULL){
            data = calloc(1, sizeof(*data));
            if(data == NULL){
                ESP_LOGE(TAG, "Out of memory");
                ctrl.status_task = STATUS_BUSY;
                continue;
            }
        }

        if(data->busy_cnt >= 5){
            memset(data, 0x0, sizeof(*data));
            ctrl.status_task |= STATUS_ERR0;
        }

        if(data->printed != 0){
            if(xQueueSend(img_queue, &data, 0) != pdTRUE){
                ctrl.status_task |= STATUS_BUSY;
                ++data->busy_cnt;
            } else {
                data = NULL;
                ctrl.status_task &= ~STATUS_BUSY;
                continue;
            }
        }
        
        if(packet->owner == own_isr){
            continue;
        }

        ESP_LOGD(TAG, "Got packet: cmd: 0x%02x status_isr: 0x%02x status_task: 0x%02x",
                  packet->cmd, ctrl.status_isr, ctrl.status_task);
        switch(packet->cmd){
        case cmd_data:
            ESP_LOGD(TAG, "cmd_data: len: 0x%x", packet->data_len);
            /* We expect to always receive complete bands (20 tiles)
             * of image data.  */
            if(   (data->printed == 0)
               && (packet->data_len % 40 == 0)
               && (data->data_len + packet->data_len <= sizeof(data->data)))
            {
                memcpy(&(data->data[data->data_len]),
                       packet->data,
                       packet->data_len);

                data->data_len += packet->data_len;
                ctrl.status_task |= STATUS_UNPROC;
            } else {
                ESP_LOGE(TAG, "Invalid data buffer length: 0x%x",
                         packet->data_len);

               ctrl.status_task |= STATUS_ERR0;
            }
            break;
        case cmd_print:
            ESP_LOGD(TAG, "cmd_print: len: 0x%x", packet->data_len);
            if(packet->data_len == sizeof(data->params)){
                memcpy(data->params, packet->data, packet->data_len);
                ctrl.status_task &= ~STATUS_UNPROC;
                ctrl.status_task |= STATUS_FULL;
                data->busy_cnt = 0;
                data->printed = 1;
            } else {
                ESP_LOGE(TAG, "Parameter buffer overrun");
                ctrl.status_task |= STATUS_ERR0;
            }
            break;
        case cmd_inquiry:
            ESP_LOGD(TAG, "cmd_inquiry: len: 0x%x", packet->data_len);
            break;
        case cmd_init:
        case cmd_break:
            ESP_LOGD(TAG, "cmd_init/break");
            memset(data, 0x0, sizeof(*data));
            ctrl.status_task = 0;
            break;
        }

        asm volatile ("" : : : "memory");
        packet->owner = own_isr;
        asm volatile ("" : : : "memory");

        ++ctrl.rd_idx;
        ctrl.rd_idx %= ARRAY_SIZE(ctrl.packets);
    }
}

void app_main()
{
    esp_err_t result;
    gpio_config_t io_cfg;
    struct pr_data *data = NULL;

    // Initialise NVS
    result = nvs_flash_init();
    if(   result == ESP_ERR_NVS_NO_FREE_PAGES
       || result == ESP_ERR_NVS_NEW_VERSION_FOUND)
    {
        ESP_ERROR_CHECK(nvs_flash_erase());
        result = nvs_flash_init();
    }
    ESP_ERROR_CHECK(result);

    memset(&ctrl, 0x0, sizeof(ctrl));

    memset(&io_cfg, 0x0, sizeof(io_cfg));
    io_cfg.intr_type = GPIO_INTR_ANYEDGE;
    io_cfg.mode = GPIO_MODE_INPUT;
    io_cfg.pull_up_en = 0;
    io_cfg.pin_bit_mask = (1u << GPIO_SCLK);

    result = gpio_config(&io_cfg);
    if(result != ESP_OK){
        ESP_LOGE(TAG, "gpio_config() failed for GPIO_SCLK");
        goto err_out;
    }

    io_cfg.intr_type = GPIO_INTR_DISABLE;
    io_cfg.mode = GPIO_MODE_INPUT;
    io_cfg.pull_up_en = 0;
    io_cfg.pin_bit_mask = (1u << GPIO_MOSI);

    result = gpio_config(&io_cfg);
    if(result != ESP_OK){
        ESP_LOGE(TAG, "gpio_config() failed for GPIO_MOSI");
        goto err_out;
    }

    io_cfg.intr_type = GPIO_INTR_DISABLE;
    io_cfg.mode = GPIO_MODE_OUTPUT_OD;
    io_cfg.pull_up_en = 0;
    io_cfg.pin_bit_mask = (1u << GPIO_MISO);

    result = gpio_config(&io_cfg);
    if(result != ESP_OK){
        ESP_LOGE(TAG, "gpio_config() failed for GPIO_MISO");
        goto err_out;
    }

    memset(&ctrl, 0x0, sizeof(ctrl));
    ctrl.packet_done = xSemaphoreCreateBinary();
    if(ctrl.packet_done == NULL){
        ESP_LOGE(TAG, "xSemaphoreCreateBinary() failed");
        goto err_out;
    }

    result = init_spiffs();
    if(result != ESP_OK){
        ESP_LOGE(TAG, "[%s] init_spiffs() failed", __func__);
        goto err_out;
    }

    result = gpio_install_isr_service(0);
    if(result != ESP_OK){
        ESP_LOGE(TAG, "[%s] gpio_install_isr_service() failed", __func__);
        goto err_out;
    }

    result = gpio_isr_handler_add(GPIO_SCLK, sclk_isr_handler, &ctrl);
    if(result != ESP_OK){
        ESP_LOGE(TAG, "[%s] gpio_isr_handler_add() failed", __func__);
        goto err_out;
    }

    img_queue = xQueueCreate(2, sizeof(struct pr_data *));
    if(img_queue == NULL){
        ESP_LOGE(TAG, "[%s] Creating packet queue failed.", __func__);
        goto err_out;
    }

#if 1
    wifi_init_softap();
    http_srv_init();
#endif

    xTaskCreate(&packet_proto_task, "packet_proto_task", 3072, NULL, 2, NULL);

    ESP_LOGI(TAG, "Entering main loop");
    while(1){
        if(xQueueReceive(img_queue, &data, portMAX_DELAY) == pdTRUE){
            save_data(data);
            free(data);
        }
    }

err_out:
    return;
}
